import React, { useEffect, useState } from 'react';
import './Footer.css';
import 'bootstrap/dist/css/bootstrap.min.css';
import { Container, Row, Col } from 'react-bootstrap'; 
export default function Footer() {
  return (
        <>
            <div className='footr'>
                    <Container>
                        <Row>
                            <Col md={6} lg={4} xs={12}>
                            <div className="footer_box1">
                                <h6>درباره ما</h6>
                                <p>
                                    وقتی تازه شروع به یادگیری برنامه نویسی کردم. یکی از مشکلاتی که در فرآیند یادگیری داشتم،
                                    کمبود آموزش های خوب با پشتیبانی قابل قبول بود که باعث شد اون موقع تصمیم بگیرم اگر روزی
                                    توانایی مالی و فنی قابل قبولی داشتم یک وب سایت برای حل این مشکل راه اندازی کنم! و خب
                                    امروز آکادمی آموزش برنامه نویسی سبزلرن به عنوان یک آکادمی خصوصی فعالیت میکنه و این به
                                    این معنی هست که هر مدرسی اجازه تدریس در اون رو نداره و باید از فیلترینگ های خاص آکادمی
                                    سبزلرن رد شه! این به این معنی هست که ما برامون فن بیان و نحوه تعامل مدرس با دانشجو بسیار
                                    مهمه! ما در آکادمی سبزلرن تضمین پشتیبانی خوب و با کیفیت رو به شما میدیم . چرا که مدرسین
                                    وب سایت سبزلرن حتی برای پشتیبانی دوره های رایگان شون هم هزینه دریافت میکنند و متعهد
                                    هستند که هوای کاربر های عزیز رو داشته باشند !
                                </p>
                            </div>
                            </Col>
                            <Col md={6} lg={4} xs={12}>
                                <div className="footer_box2">
                                    <h6>آخرین مطالب</h6>

                                    <a href="#">نحوه نصب کتابخانه در پایتون | آموزش نصب کتابخانه پایتون</a>
                                    <br /><br />
                                    <a href="#">چگونه پایتون را آپدیت کنیم؟ | آموزش صفر تا صد آپدیت کردن پایتون </a>
                                    <br /><br />
                                    <a href="#">آموزش نصب پایتون ( Python ) در در مک، ویندوز و لینوکس | گام به گام و تصویری </a>
                                    <br /><br />
                                    <a href="#">بهترین فریم ورک های فرانت اند | 16 فریم ورک Front end بررسی معایب و مزایا </a>
                                    <br /><br />
                                    <a href="#">معرفی بهترین سایت آموزش جاوا اسکریپت [ تجربه محور ] + آموزش رایگان </a>
                                </div>
                            </Col>

                            <Col md={6} lg={4} xs={12}>
                                <h6>دسترسی سریع</h6>
                                <div className="footer_box3_1">
                                    <div className="footer_box3_2">
                                    <a href="#">آموزش HTML </a>
                                    <br /><br />
                                    <a href="#">آموزش CSS </a>
                                    <br /><br />
                                    <a href="#">آموزش ریکت </a>
                                </div>
                                <div className="footer_box3_2">
                                    <a href="#">آموزش HTML </a>
                                    <br /><br />
                                    <a href="#">آموزش CSS </a>
                                    <br /><br />
                                    <a href="#">آموزش ریکت </a>
                                </div>
                                </div>
                            </Col>
                        </Row>
                    </Container>
            </div>

        </>
  )
}
